export const dynamic = "force-dynamic";
import MotionWrapper from "@components/MotionWrapper";

export default function Header() {
    return (
        <div className="flex flex-col min-h-screen font-sansn lg:mx-20 md:mx-10 mx-4 text-black mb-18">
            <MotionWrapper>
                <p className="xl:text-4xl md:text-3xl text-lg text-shadow-lg text-center lg:mt-10 mt-4">
                    พรบ. คุ้มครองข้อมูลส่วนบุคคล
                </p>
            </MotionWrapper>

            <MotionWrapper>
                <div className="border border-t mt-8"></div>
            </MotionWrapper>

            <MotionWrapper>
                <p className="lg:mt-10 mt-4 md:text-xl text-xs font-medium text-shadow-lg">
                    นโยบายเว็บไซต์
                </p>
            </MotionWrapper>

            <MotionWrapper>
                <p className="lg:mt-10 mt-4 md:text-base text-xs font-medium text-shadow-lg">
                    1. วัตถุประสงค์
                </p>
                <p className="md:text-base text-xs mt-2">
                    เว็บไซต์สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิได้จัดทำขึ้นเพื่อให้บริการข้อมูล สารสนเทศ และบริการอิเล็กทรอนิกส์ แก่ประชาชน ได้จัดทำขึ้นเพื่อเผยแพร่ประชาสัมพันธ์ข้อมูล
                    ข่าวสารและให้บริการที่เกี่ยวเนื่องกับสถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิ ในการใช้บริการเว็บไซต์ของผู้ใช้บริการจะอยู่ภายใต้เงื่อนไขและข้อกำหนดดังต่อไปนี้
                    ผู้ใช้บริการจึงควรศึกษาเงื่อนไข และข้อกำหนดการใช้เว็บไซต์ และ/เงื่อนไขและข้อตกลงอื่นๆที่สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิได้แจ้งให้ทราบบนเว็บไซต์โดยละเอียดก่อนการเข้าใช้บริการ
                    ทั้งนี้ ในการใช้บริการให้ถือว่าผู้ใช้บริการได้ตกลงที่จะปฏิบัติตามเงื่อนไขและข้อกำหนดการให้บริการที่กำหนดไว้นี้ หากผู้ใช้บริการไม่ประสงค์ที่จะผูกพันตามข้อกำหนดและเงื่อนไขการให้บริการ
                    ขอความกรุณาท่านยุติการเข้าชมและใช้งานเว็บไซต์นี้ในทันที
                </p>
            </MotionWrapper>

            <MotionWrapper>
                <p className="lg:mt-10 mt-4 md:text-base text-xs font-medium text-shadow-lg">
                    2. เงื่อนไขและข้อกําหนดการใช้งานเว็บไซต์
                </p>
                <p className="md:text-base text-xs mt-2">
                    2.1 ผู้ใช้บริการอาจได้รับ เข้าถึง หรือแสดงข้อมูล เช่น ไฟล์ข้อมูล ข้อความลายลักษณ์อักษร
                    ซอฟต์แวร์คอมพิวเตอร์ ดนตรี ไฟล์เสียง หรือเสียงอื่นๆ ภาพถ่าย วิดีโอ หรือรูปภาพอื่นๆ
                    โดยเป็นส่วนหนึ่งของบริการหรือโดยผ่านการใช้บริการ ซึ่งต่อไปนี้จะเรียกว่า
                    <span className="font-medium"> เนื้อหา</span>
                </p>

                <p className="md:text-base text-xs mt-2">
                    2.2 เนื้อหาที่นําเสนอต่อผู้ใช้บริการ อาจได้รับการคุ้มครองโดยสิทธิในทรัพย์สินทางปัญญาของเจ้าของเนื้อหานั้น ผู้ใช้บริการไม่มีสิทธิเปลี่ยนแปลงแก้ไข
                    จําหน่ายจ่ายโอนหรือสร้างผลงานต่อเนื่องโดยอาศัยเนื้อหาดังกล่าว ไม่ว่าจะทั้งหมดหรือบางส่วน เว้นแต่ผู้ใช้บริการจะได้รับอนุญาตโดยชัดแจ้งจากเจ้าของเนื้อหานั้น
                </p>
                <p className="md:text-base text-xs mt-2">
                    2.3 ผู้ใช้บริการอาจพบเนื้อหาที่ไม่เหมาะสม หรือหยาบคาย อันก่อให้เกิดความไม่พอใจ ภายใต้ความเสี่ยงของตนเอง
                </p>
                <p className="md:text-base text-xs mt-2">
                    2.4 สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิทรงไว้ซึ่งสิทธิในการคัดกรอง ตรวจทาน ทําเครื่องหมาย เปลี่ยนแปลง แก้ไข ปฏิเสธ หรือลบเนื้อหาใดๆ ที่ไม่เหมาะสมออกจากบริการ
                    ซึ่งสถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิอาจจัดเตรียมเครื่องมือในการคัดกรองเนื้อหาอย่างชัดเจน โดยไม่ขัดต่อกฎหมาย กฎ ระเบียบของทางราชการที่เกี่ยวข้อง
                </p>
                <p className="md:text-base text-xs mt-2">
                    2.5 เว็บไซต์สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิ อาจหยุดให้บริการเป็นการชั่วคราวหรือถาวร หรือยกเลิกการให้บริการ แก่ผู้ใช้บริการรายใดเป็นการเฉพาะ
                    หากการให้บริการดังกล่าวส่งผลกระทบต่อผู้ใช้บริการอื่นๆ หรือขัดแย้งต่อกฎหมาย โดยไม่ต้องแจ้งให้ผู้ใช้บริการทราบล่วงหน้า
                </p>
            </MotionWrapper>

            <MotionWrapper>
                <p className="lg:mt-10 mt-4 md:text-base text-x font-medium text-shadow-lg">
                    3. สิทธิหน้าที่ และความรับผิดชอบของผู้ใช้บริการ
                </p>
                <p className="md:text-base text-xs mt-2">
                    3.1 ผู้ใช้บริการจะใช้บริการเว็บไซต์สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิ เพื่อวัตถุประสงค์ที่ได้รับอนุญาตตามข้อกําหนดของสถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิและไม่ขัดต่อกฎหมาย
                    กฎ ระเบียบ ข้อบังคับ หลักปฏิบัติที่เป็นที่ยอมรับโดยทั่วไป
                </p>
                <p className="md:text-base text-xs mt-2">
                    3.2 ผู้ใช้บริการจะไม่เข้าใช้หรือพยายามเข้าใช้บริการหนึ่งบริการใดโดยวิธีอื่น รวมถึงการใช้วิธีการอัตโนมัติ (การใช้สคริปต์) นอกจากช่องทางที่เว็บไซต์สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิจัดเตรียมไว้ให้
                    เว้นแต่ผู้ใช้บริการจะได้รับอนุญาตจากสถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิโดยชัดแจ้งให้ทําเช่นนั้นได้
                </p>
                <p className="md:text-base text-xs mt-2">
                    3.3 ผู้ใช้บริการจะไม่ทําหรือมีส่วนร่วมในการขัดขวางหรือรบกวนบริการของเว็บไซต์สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิ รวมทั้งเครื่องแม่ข่ายและเครือข่ายที่เชื่อมต่อกับบริการ
                </p>
                <p className="md:text-base text-xs mt-2">
                    3.4 ผู้ใช้บริการจะไม่ทําสําเนา คัดลอก ทําซ้ำ ขาย แลกเปลี่ยน หรือขายต่อบริการเพื่อวัตถุประสงค์ใดๆ เว้นแต่ผู้ใช้บริการจะได้รับอนุญาตจากสถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิโดยชัดแจ้งให้ทําเช่นนั้นได้
                </p>
                <p className="md:text-base text-xs mt-2">
                    3.5 ผู้ใช้บริการจะเป็นผู้รับผิดชอบแต่เพียงผู้เดียวต่อบุคคลใดๆ รวมถึงสถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิในความเสียหายอันเกิดจากการละเมิดข้อกําหนด
                </p>
            </MotionWrapper>

            <MotionWrapper>
                <p className="lg:mt-10 mt-4 md:text-base text-xs font-medium text-shadow-lg">
                    4. การเชื่อมโยงกับเว็บไซต์อื่นๆ
                </p>
                <p className="md:text-base text-xs mt-2">
                    4.1 การเชื่อมโยงไปยังเว็บไซต์อื่นเป็นเพียงการให้บริการเพื่ออํานวยความสะดวกแก่ผู้ใช้บริการเท่านั้น สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิมิได้มีส่วนเกี่ยวข้องหรือมีอํานาจควบคุม
                    รับรองความถูกต้อง ความน่าเชื่อถือ ตลอดจนความรับผิดชอบในเนื้อหาข้อมูลของเว็บไซต์นั้น ๆ และสถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิไม่รับผิดชอบต่อเนื้อหาใด ๆ
                    ที่แสดงบนเว็บไซต์อื่นที่เชื่อมโยงมายังเว็บไซต์สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิหรือต่อความเสียหายใด ๆ ที่เกิดขึ้นจากการเข้าเยี่ยมชมเว็บไซต์ดังกล่าว
                </p>
                <p className="md:text-base text-xs mt-2">
                    4.2 กรณีต้องการเชื่อมโยงมายังเว็บไซต์สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิ ผู้ใช้บริการสามารถเชื่อมโยงมายังหน้าแรกของเว็บไซต์สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิได้
                    และสถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิจะไม่รับผิดชอบต่อเนื้อหาใด ๆ ที่แสดงบนเว็บไซต์ที่เชื่อมโยงมายังเว็บไซต์สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิหรือต่อความเสียหายใด ๆ
                    ที่เกิดขึ้นจากการใช้เว็บไซต์เหล่านั้น
                </p>
            </MotionWrapper>

            <MotionWrapper>
                <p className="lg:mt-10 mt-4 md:text-base text-xs font-medium text-shadow-lg">
                    5. การปฏิเสธความรับผิด
                </p>
                <p className="md:text-base text-xs mt-2">
                    5.1 สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิจะไม่รับผิดต่อความเสียหายใด ๆ รวมถึง ความเสียหายสูญเสียและค่าใช้จ่ายที่เกิดขึ้น ไม่ว่าโดยตรงหรือโดยอ้อม
                    ที่เป็นผลหรือสืบเนื่องจากการที่ผู้ใช้เข้าใช้เว็บไซต์สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมินี้หรือเว็บไซต์ที่เชื่อมโยงกับเว็บไซต์สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมินี้หรือต่อความเสียหาย
                    สูญเสียหรือค่าใช้จ่ายที่เกิดจากความล้มเหลวในการใช้งาน ความผิดพลาด การละเว้น การหยุดชะงัก ข้อบกพร่อง ความไม่สมบูรณ์ คอมพิวเตอร์ไวรัส ถึงแม้ว่า
                    สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิจะได้รับ แจ้งว่าอาจจะเกิดความเสียหายสูญเสียหรือค่าใช้จ่ายดังกล่าวขึ้น นอกจากนี้
                    สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิไม่รับผิดต่อผู้ใช้เว็บไซต์สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิหรือบุคคลจากการเรียกร้องใด ๆ ที่เกิดขึ้นจากบนเว็บไซต์สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิหรือเนื้อหาใด ๆ
                    ซึ่งรวมถึงการตัดสินใจหรือการกระทําใด ๆ ที่เกิดจากความเชื่อถือในเนื้อหาดังกล่าวของผู้ใช้เว็บไซต์สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิ หรือในความเสียหายใด ๆ ไม่ว่าความเสียหายทางตรง หรือทางอ้อม
                    รวมถึงความเสียหายอื่นใดที่อาจเกิดขึ้นได้ผู้ใช้บริการยอมรับและตระหนักดีว่า สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิจะไม่ต้องรับผิดชอบต่อการกระทําใดของผู้ใช้บริการทั้งสิ้น
                </p>
            </MotionWrapper>

            <MotionWrapper>
                <p className="lg:mt-10 mt-4 md:text-base text-xs font-medium text-shadow-lg">
                    6. กรรมสิทธิ์และสิทธิในทรัพย์สินทางปัญญา
                </p>
                <p className="md:text-base text-xs mt-2">
                    6.1 สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิหรือผู้ให้อนุญาตแก่สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิเป็นผู้มีสิทธิตามกฎหมายแต่เพียงผู้เดียวใน กรรมสิทธิ์ ผลประโยชน์ทั้งหมด รวมถึงสิทธิในทรัพย์สินทางปัญญาใดๆ
                    ที่มีอยู่ในบริการซึ่งสถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิหรือ ผู้ให้อนุญาตแก่สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิเป็นผู้จัดทําขึ้น ไม่ว่าสิทธิเหล่านั้นจะได้รับการจดทะเบียนไว้หรือไม่ก็ตาม
                </p>
                <p className="md:text-base text-xs mt-2">
                    6.2 ผู้ใช้บริการจะต้องไม่ใช้ชื่อทางการค้า เครื่องหมายการค้า เครื่องหมายการบริการ ตราสัญลักษณ์ ชื่อโดเมนของเว็บไซต์สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิ โดยไม่ได้รับความยินยอมเป็นลายลักษณ์อักษรจากสถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิญญาใดๆ
                    ที่มีอยู่ในบริการซึ่งสถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิหรือ ผู้ให้อนุญาตแก่สถานคุ้มครองและพัฒนาคนพิการบ้านนนทภูมิเป็นผู้จัดทําขึ้น ไม่ว่าสิทธิเหล่านั้นจะได้รับการจดทะเบียนไว้หรือไม่ก็ตาม
                </p>
            </MotionWrapper>

            <MotionWrapper>
                <p className="lg:mt-10 mt-4 md:text-base text-xs font-medium text-shadow-lg">
                    7. กฎหมายที่ใช้บังคับ
                </p>
                <p className="md:text-base text-xs mt-2">
                    7.1 การตีความ และการบังคับตามเงื่อนไขการให้บริการฉบับนี้ให้เป็นไปตามกฎหมายไทย
                </p>
            </MotionWrapper>

        </div>
    );
}