export const dynamic = "force-dynamic";
export default function AboutMission(){
    return(
        <div className="lg:mx-20 md:mx-12 mx-5 lg:my-16 md:my-10 my-4 text-black">
            <div>
                <p className="text-center lg:text-5xl md:text-3xl text-xl text-shadow-lg">ภารกิจและหน้าที่รับผิดชอบ</p>
            </div>
            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p>1. การฟื้นฟูสมรรถภาพทางการแพทย์</p>
                <ul className="list-disc ms-8">
                    <li>ให้บริการดูแลสุขภาพและฟื้นฟูโดยพยาบาลและเจ้าหน้าที่สาธารณสุข</li>
                    <li>มีพยาบาลประจำตลอด 24 ชั่วโมง</li>
                    <li>มีความร่วมมือกับ รพ.บางจาก, สภากาชาดไทย, เทศบาลพระประแดง</li>
                    <li>จัดกิจกรรมด้านสุขภาพ เช่น</li>
                    <li className="ms-6">โครงการ "บ้านพระประแดงยุคใหม่ใส่ใจสุขภาพ"</li>
                    <li className="ms-6">ตรวจสุขภาพประจำปี / ฉีดวัคซีนไข้หวัดใหญ่</li>
                    <li className="ms-6">ให้ความรู้ด้านสุขอนามัย / การช่วยฟื้นคืนชีพ</li>
                    <li>กำลังดำเนินการยกระดับสถานคุ้มครองเป็น “สถานชีวาภิบาล” ตาม พ.ร.บ.สาธารณสุข</li>
                </ul>
            </div>
            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p>2. การเข้าถึงการศึกษา</p>
                <ul className="list-disc ms-8">
                    <li>ส่งเสริมการเรียนรู้ร่วมกับ “ศูนย์การศึกษานอกระบบอำเภอพระประแดง”</li>
                    <li>มีการจัดสอนในระดับประถม - มัธยมปลาย</li>
                    <li>มีผู้พิการเข้าร่วมกิจกรรมการศึกษา 20 คน</li>
                    <li>ช่วยให้ผู้พิการพัฒนาทักษะทางสติปัญญาและอารมณ์</li>
                    <li>บางรายสามารถนำความรู้ไปต่อยอดอาชีพและพึ่งพาตนเองได้</li>
                </ul>
            </div>
            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p>3. การฟื้นฟูสมรรถภาพด้านอาชีพ</p>
                <ul className="list-disc ms-8">
                    <li>ให้บริการดูแลสุขภาพและฟื้นฟูโดยพยาบาลและเจ้าหน้าที่สาธารณสุข</li>
                    <li>ฝึกอาชีพให้คนพิการ เช่น</li>
                    <li className="ms-6">งานสานตะกร้าพลาสติกย่านลิเภา</li>
                    <li className="ms-6">เพ้นท์กระเป๋าผ้า</li>
                    <li>มีการจัดหาอุปกรณ์ฝึก / เบี้ยเลี้ยงระหว่างฝึก</li>
                    <li>ส่งเสริมการขายผลิตภัณฑ์ผ่าน</li>
                    <li className="ms-6">ตลาดนัด</li>
                    <li className="ms-6">งานมหกรรม</li>
                    <li className="ms-6">ช่องทางออนไลน์</li>
                    <li>ร่วมมือกับ มูลนิธิและมหาวิทยาลัย (เช่น ม.พระจอมเกล้าธนบุรี) เพื่อพัฒนาทักษะอาชีพอิสระ</li>
                </ul>
            </div>
            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p>4. การมีส่วนร่วมในสังคม</p>
                <ul className="list-disc ms-8">
                    <li>ส่งเสริมให้คนพิการเข้าร่วมกิจกรรมทางสังคม วัฒนธรรม และศาสนา เช่น</li>
                    <li className="ms-6">วันสงกรานต์, ลอยกระทง, ส่งท้ายปีเก่า</li>
                    <li>จัด “โครงการพัฒนาทักษะชีวิต” ให้คนพิการฝึกใช้ชีวิตนอกสถาน เช่น</li>
                    <li className="ms-6">ฝึกซื้อของ, เดินทาง, เข้าร้านสะดวกซื้อ, ข้ามถนน</li>
                    <li>มีนักสังคมสงเคราะห์ 4 คน ให้บริการผู้พิการ 460 คน (เฉลี่ย 1:115)</li>
                </ul>
            </div>
            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p>5. การเข้าถึงนโยบายและสิทธิภาครัฐ</p>
                <ul className="list-disc ms-8">
                    <li>ประสานงานกับสถาบันสิรินธร เพื่อจัดหากายอุปกรณ์ช่วยเหลือ</li>
                    <li>ดำเนินโครงการแก้ไข “ปัญหาสถานะบุคคล”</li>
                    <li className="ms-6">พิสูจน์ตัวตน / ทำบัตรประชาชน / สืบหาญาติ</li>
                    <li>คนพิการกว่า 80% ได้รับสิทธิและสวัสดิการตามกฎหมาย</li>
                </ul>
            </div>
            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p>6. การสื่อสารและเทคโนโลยีสารสนเทศ</p>
                <ul className="list-disc ms-8">
                    <li>มีระบบโทรศัพท์และแอปฯ Line สำหรับติดต่อญาติ</li>
                    <li>ติดตั้งทีวีในเรือนนอนทุกหลังเพื่อรับข่าวสาร</li>
                    <li>เปิดให้นักศึกษา หน่วยงานภายนอก เข้ามาศึกษาดูงาน</li>
                    <li>สนับสนุนการให้คำปรึกษาและสร้างเครือข่ายช่วยเหลือ</li>
                </ul>
            </div>
            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p>การสนับสนุนอาชีพและการจ้างงาน</p>
                <ul className="list-disc ms-8">
                    <li>ฝึกอาชีพให้คนพิการในความดูแลอย่างต่อเนื่อง</li>
                    <li>คนพิการบางส่วนเข้าฝึกตามมาตรา 33 และ 35 (กฎหมายจ้างงานคนพิการ)</li>
                    <li>มีโครงการพระราชดำริ “จักสานย่านลิเภา” ภายใต้มูลนิธิศิลปาชีพ</li>
                    <li>คนพิการในโครงการราว 9.11% ของผู้ช่วยเหลือตนเองได้</li>
                </ul>
            </div>
        </div>
    );
}