"use client";
import Image from "next/image";
import { useState } from "react";
import { getSupabaseImage } from "@lib/image";
export const dynamic = "force-dynamic";
export default function AboutMission() {
    const [openImage, setOpenImage] = useState(null);
    return (
        <div className="lg:mx-20 md:mx-12 mx-5 lg:my-16 md:my-10 my-4 text-black">
            <div>
                <p className="text-center lg:text-4xl md:text-3xl text-xl text-shadow-lg">บัตรประจำตัวคนพิการ</p>
            </div>

            <div className="border border-t mt-8"></div>

            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p className="font-medium text-shadow-lg">1. คุณสมบัติของคนพิการที่ยื่นคำขอ</p>
                <div className="ms-8">
                    <p>1.1 เป็นบุคคลผู้มีสัญชาติไทย</p>
                    <p>1.2 บุคคลที่ยังไม่ได้แจ้งเกิดหรือบุคคลที่ไม่ปรากฏแน่ชัดว่าสัญชาติไทยต้องดำเนินการตามขั้นตอนตามพระราชบัญญัติการทะเบียนราษฎร์พ.ศ.2534 และที่แก้ไขเพิ่มเติม (ฉบับที่ 2) ก่อน</p>
                </div>
            </div>
            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p className="font-medium text-shadow-lg">2. สถานที่ให้บริการออกบัตรประจำตัวคนพิการ</p>
                <div className="ms-8">
                    <p>2.1 กรุงเทพมหานคร</p>
                    <p className="ms-6">(1) ศูนย์บริการคนพิการกรุงเทพมหานคร ณ กรมส่งเสริมและพัฒนาคุณภาพชีวิตคนพิการ</p>
                    <p className="ms-6">(2) โรงพยาบาลสิรินธร</p>
                    <p className="ms-6">(3) โรงพยาบาลผู้สูงอายุบางขุนเทียน</p>
                    <p className="ms-6">(4) สถาบันราชานุกูล</p>
                    <p className="ms-6">(5) โรงพยาบาลนพรัตนราชธานี</p>
                    <p className="ms-6">(6) โรงพยาบาลเมตตาประชารักษ์ (วัดไร่ขิง)</p>
                    <p className="ms-6">(7) ศูนย์บริการคนพิการสายไหม เคหะเอื้ออาทรสายไหม</p>
                    <p className="ms-6">(8) สถาบันสุขภาพเด็กแห่งชาติ มหาราชินี (โรงพยาบาลเด็ก)</p>
                    <p className="font-medium text-shadow-lg">**หมายเหตุ หน่วยออกบัตรประจำตัวคนพิการ ข้อ 2.1 จะหยุดทุกวันทำการ ทุกสิ้นเดือน</p>
                    <p>2.2 ศูนย์บริการคนพิการจังหวัด……</p>
                </div>
            </div>
            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p className="font-medium text-shadow-lg">3. สถานที่ยื่นคำขอมีบัตรประจำตัวคนพิการ</p>
                <div className="ms-8">
                    <p>3.1 กรุงเทพมหานคร</p>
                    <p className="ms-6">(1) ฝ่ายสังคมสงเคราะห์งานเวชศาสตร์ฟื้นฟู โรงพยาบาลศิริราช</p>
                    <p className="ms-6">(2) ฝ่ายสังคมสงเคราะห์ สถาบันสุขภาพเด็กแห่งชาติ มหาราชินี</p>
                    <p className="ms-6">(3) โรงพยาบาลพระมงกุฎเกล้า</p>
                    <p>3.2 จังหวัด</p>
                    <p className="ms-6">(1) โรงพยาบาลประจำจังหวัด/อำเภอ ที่มีศูนย์บริการแบบเบ็ดเสร็จในโรงพยาบาล</p>
                    <p className="ms-6">(2) องค์กรปกครองส่วนท้องถิ่น</p>
                    <p className="ms-6">(3) หรือหน่วยงานของรัฐอื่นตามที่ผู้ว่าราชการจังหวัดประกาศกำหนด</p>
                </div>
            </div>
            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p className="font-medium text-shadow-lg">4. เอกสารหลักฐานประกอบการยื่นคำขอมีบัตรประจำตัวคนพิการ</p>
                <div className="ms-8">
                    <p>4.1 เอกสารหลักฐานของคนพิการ</p>
                    <div className="ms-8">
                        <p>(1) เอกสารประจําตัวอย่างใดอย่างหนึ่ง  ดังนี้</p>
                        <p className="ms-6">(ก) บัตรประจําตัวประชาชน</p>
                        <p className="ms-6">(ข) บัตรประจําตัวข้าราชการ</p>
                        <p className="ms-6">(ค) สูติบัตรสําหรับบุคคลอายุต่ำกว่าสิบห้าปี</p>
                        <p className="ms-6">(ง) หนังสือรับรองการเกิดตามแบบที่กรมการปกครองกําหนด</p>
                        <p>(2) ทะเบียนบ้านของคนพิการ</p>
                        <p>กรณีที่คนพิการมีทะเบียนบ้าน แต่ไม่มีบัตรประชาชน ต้องดำเนินการตามขั้นตอนตามพระราชบัญญัติการทะเบียนราษฎร์ พ.ศ.2534 และที่แก้ไขเพิ่มเติม(ฉบับที่ 2) พ.ศ.2551 ก่อน</p>
                        <p>(3) รูปถ่ายคนพิการ ขนาด 1 นิ้ว ถ่ายมาแล้วไม่เกิน 6 เดือน จำนวน 2 รูป ในกรณีที่คนพิการไม่ได้มายื่นคำขอด้วยตนเอง</p>
                        <p>(4) เอกสารรับรองความพิการ ซึ่งรับรองโดยผู้ประกอบวิชาชีพเวชกรรมของสถานพยาบาลของรัฐ หรือสถานพยาบาลเอกชนที่อธิบดีประกาศกําหนด</p>
                        <p>(5)  สภาพความพิการเป็นที่เห็นได้โดยประจักษ์ ให้เจ้าหน้าที่ผู้รับคำขอถ่ายสภาพความพิการไว้เป็นหลักฐาน</p>
                    </div>
                    <div>
                        <p>4.2 เอกสารหลักฐานของผู้ดูแลคนพิการ (เป็นผู้ซี่งมีชื่ออยู่ในทะเบียนบ้านเดียวกันกับคนพิการ หรือเป็นผู้ดูแลคนพิการซี่งคนพิการอาศัยอยู่ด้วยตามความเป็นจริง)</p>
                        <p className="ms-6">(1)  บัตรประชาชนของผู้ดูแลคนพิการ</p>
                        <p className="ms-6">(2)  ทะเบียนบ้านของผู้ดูแลคนพิการ</p>
                    </div>
                    <div>
                        <p className="font-medium text-shadow-lg">กรณีคนพิการมิได้มาแจ้งหรือไม่สามารถแจ้งได้</p>
                        <div className="ms-8">
                            <p>(1)  หนังสือรับรองการเป็นผู้ดูแลคนพิการ จำนวน 1 ฉบับ</p>
                            <p className="ms-6">- ผู้รับรอง : กํานัน ผู้ใหญ่บ้าน ข้าราชการ พนักงานราชการ พนักงานรัฐวิสาหกิจ สมาชิกสภาท้องถิ่น ประธานชุมชน ลูกจ้างประจํา
                                (หน่วยงานราชการ, รัฐวิสาหกิจ) โดยผู้รับรองต้องอาศัยอยู่หรือปฏิบัติหน้าที่ในพื้นที่เดียวกับที่คนพิการอาศัยอยู่ในปัจจุบัน</p>
                            <p>(2)  สำเนาบัตรประจำตัวของผู้รับรอง พร้อมรับรองสําเนา จำนวน 1 ฉบับ</p>
                            <p className="ms-6">* ข้าราชการบำนาญ ไม่สามารถรับรองหนังสือนี้ได้</p>
                            <p className="ms-6"> * การรับรองจะสมบูรณ์ เมื่อพยานลงนามครบถ้วน</p>
                            <p className="ms-6"> * การรับรองอันเป็นเท็จมีความผิดตามกฎหมายทั้งทางแพ่งและทางอาญา</p>
                        </div>
                        <p>4.3 บุคคลอื่นยื่นคำขอมีบัตรฯ แทนคนพิการ</p>
                        <p className="ms-6">(1)  สำเนาบัตรประชาชนของบุคคลที่ดำเนินการแทน</p>
                        <p className="ms-6">(2)  หนังสือมอบอำนาจ เป็นหลักฐานว่าได้รับมอบจากคนพิการ (พยานต้องลงนามครบถ้วน)</p>
                        <p>กรณีคนพิการเป็นผู้เยาว์ คนเสมือนไร้ความสามารถ หรือคนไร้ความสามารถ หรือมีความพิการมากไม่สามารถดำเนินการเองได้ ผู้ปกครอง ผู้พิทักษ์ ผู้อนุบาล หรือผู้ดูแล ดำเนินการแทนได้</p>
                    </div>
                </div>
            </div>
            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p className="font-medium text-shadow-lg">5. เอกสารหลักฐานประกอบการยื่นคำขอมีบัตรประจำตัวคนพิการใหม่ เนื่องจากบัตรเดิมหมดอายุ ชำรุด  สูญหาย มีการเปลี่ยนแปลงในสาระสำคัญเกี่ยวกับคนพิการ อายุครบหกสิบปีบริบูรณ์</p>
                <div className="ms-8">
                    <p>5.1  เอกสารหลักฐานของคนพิการ</p>
                    <p className="ms-6">(1) บัตรประจำตัวคนพิการใบเดิม</p>
                    <p className="ms-6">(2) เอกสารประจําตัวอย่างใดอย่างหนึ่ง ดังนี้</p>
                    <p className="ms-8">(ก) บัตรประจําตัวประชาชน</p>
                    <p className="ms-8">(ข) สําเนาบัตรประจําตัวข้าราชการ</p>
                    <p className="ms-8">(ค) สูติบัตรสําหรับบุคคลอายุต่ำกว่าสิบห้าปี</p>
                    <p className="ms-8">(ง) หนังสือรับรองการเกิดตามแบบที่กรมการปกครองกําหนด</p>

                    <p className="ms-6">(3) ทะเบียนบ้านของคนพิการ</p>
                    <p className="ms-8">กรณีที่คนพิการมีทะเบียนบ้าน แต่ไม่มีบัตรประชาชน ต้องดำเนินการตามขั้นตอนตามพระราชบัญญัติการทะเบียนราษฎร์ พ.ศ.2534 และที่แก้ไขเพิ่มเติม (ฉบับที่ 2) พ.ศ.2551 ก่อน</p>

                    <p className="ms-6">(4)  หนังสือสำคัญแสดงการเปลี่ยนชื่อตัว หรือชื่อสกุล</p>
                    <p className="ms-6">(5)  รูปถ่ายคนพิการ ขนาด 1 นิ้ว ถ่ายมาแล้วไม่เกิน 6 เดือน จำนวน 2 รูป ในกรณีที่คนพิการไม่ได้มายื่นคำขอด้วยตนเอง</p>
                    <p className="ms-6">(6)  กรณีมีความพิการเพิ่ม หรือเปลี่ยนไปจากเดิม</p>
                    <p className="ms-8">- เอกสารรับรองความพิการ ซึ่งรับรองโดยผู้ประกอบวิชาชีพเวชกรรมของสถานพยาบาลของรัฐ หรือสถานพยาบาลเอกชนที่อธิบดีประกาศกําหนด</p>
                    <p className="ms-8">- สภาพความพิการเป็นที่เห็นได้โดยประจักษ์ ให้เจ้าหน้าที่ผู้รับคำขอถ่ายสภาพความพิการไว้เป็นหลักฐาน</p>

                    <p>5.2  เอกสารหลักฐานของผู้ดูแลคนพิการ (ผู้ซึ่งมีชื่ออยู่ในทะเบียนบ้านเดียวกันกับคนพิการ หรือเป็นผู้ดูแลคนพิการ ซี่งคนพิการอาศัยอยู่ด้วยตามความเป็นจริง)</p>
                    <p className="ms-6">(1) บัตรประชาชนของผู้ดูแลคนพิการ</p>
                    <p className="ms-6">(2) ทะเบียนบ้านของผู้ดูแลคนพิการ</p>

                    <p className="font-medium text-shadow-lg">กรณีคนพิการมิได้มาแจ้งหรือไม่สามารถแจ้งได้</p>
                    <p className="ms-6">(1) หนังสือรับรองการเป็นผู้ดูแลคนพิการ </p>
                    <p className="ms-8">- ผู้รับรอง : กํานัน ผู้ใหญ่บ้าน ข้าราชการ พนักงานราชการ พนักงานรัฐวิสาหกิจ สมาชิกสภาท้องถิ่น ประธานชุมชน ลูกจ้างประจํา (หน่วยงานราชการ, รัฐวิสาหกิจ)
                        โดยผู้รับรองต้องอาศัยอยู่หรือปฏิบัติหน้าที่ในพื้นที่เดียวกับที่คนพิการอาศัยอยู่ในปัจจุบัน</p>
                    <p className="ms-6">(2) สำเนาบัตรประจำตัวของผู้รับรอง พร้อมรับรองสําเนา จำนวน 1 ฉบับ</p>
                    <p className="ms-8">* ข้าราชการบำนาญ ไม่สามารถรับรองหนังสือนี้ได้</p>
                    <p className="ms-8">* การรับรองจะสมบูรณ์ เมื่อพยานลงนามครบถ้วน</p>
                    <p className="ms-8">* การรับรองอันเป็นเท็จมีความผิดตามกฎหมายทั้งทางแพ่งและทางอาญา</p>

                    <p>5.3  บุคคลอื่นยื่นคำขอมีบัตรฯ แทนคนพิการ</p>
                    <p className="ms-6">(1) สำเนาบัตรประชาชนของบุคคลที่ดำเนินการแทน</p>
                    <p className="ms-6">(2) หนังสือมอบอำนาจ เป็นหลักฐานว่าได้รับมอบจากคนพิการ (พยานต้องลงนามครบถ้วน*)</p>
                    <p className="font-medium text-shadow-lg">กรณีคนพิการเป็นผู้เยาว์ คนเสมือนไร้ความสามารถ หรือคนไร้ความสามารถ หรือมีความพิการถึงขั้นไม่สามารถดำเนินการเองได้
                        ผู้ปกครอง ผู้พิทักษ์ ผู้อนุบาล หรือผู้ดูแล ดำเนินการแทนได้</p>
                </div>
            </div>
            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p className="font-medium text-shadow-lg">6. กรณีคนพิการที่มีบัตรประจำตัวคนพิการถึงแก่ความตาย หรือได้รับการแก้ไข ฟื้นฟู จนไม่มีสภาพความพิการ หรือมีความประสงค์ยกเลิกการมีบัตรประจำตัวคนพิการ
                    ให้ผู้มีบัตรประจำตัวคนพิการหรือบุคคลที่ดำเนินการแทน แจ้งต่อนายทะเบียนเพื่อจำหน่ายออกจากทะเบียนบัตรประจำตัวคนพิการต่อไป</p>
                <div className="ms-8">
                    <p>6.1  เอกสารหลักฐานประกอบการยื่นคำขอ กรณีคนพิการที่มีบัตรประจำตัวคนพิการถึงแก่ความตาย </p>
                    <div className="ms-6">
                        <p>(1) บัตรประจำตัวคนพิการ (ถ้ามี) </p>
                        <p>(2) บัตรประจำตัวประชาชนของคนพิการ</p>
                        <p>(3) ทะเบียนบ้านของคนพิการ</p>
                        <p>(4) สำเนาใบมรณะบัตร</p>
                    </div>
                    <p>6.2  เอกสารหลักฐานประกอบการยื่นคำขอ กรณีได้รับการแก้ไขฟื้นฟูจนไม่มีสภาพความพิการ หรือมีความประสงค์ยกเลิกการมีบัตรประจำตัวคนพิการ</p>
                    <div className="ms-6">
                        <p>(1) บัตรประจำตัวคนพิการ</p>
                        <p>(2) บัตรประจำตัวประชาชนของคนพิการ</p>
                        <p>(3) ทะเบียนบ้านของคนพิการ</p>
                        <p>(4) เอกสารรับรองความพิการ ซึ่งรับรองโดยผู้ประกอบวิชาชีพเวชกรรมของสถานพยาบาลของรัฐ หรือสถานพยาบาลเอกชนที่อธิบดีประกาศกําหนด</p>
                        <p>(5) ยื่นคำขอแทน ใช้สำเนาบัตรประจำตัวประชาชนหรือสำเนาทะเบียนบ้านของผู้ดำเนินการแทน และหนังสือมอบอำนาจ (พยานต้องลงนามครบถ้วน*)</p>
                    </div>
                    <p className="font-medium text-shadow-lg">กรณีคนพิการเป็นผู้เยาว์ คนเสมือนไร้ความสามารถ หรือคนไร้ความสามารถ หรือมีความพิการถึงขั้นไม่สามารถดำเนินการเองได้
                        ผู้ปกครอง ผู้พิทักษ์ ผู้อนุบาล หรือผู้ดูแล ดำเนินการแทนได้</p>
                </div>
            </div>


            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p className="font-medium text-shadow-lg">สิทธิการอุทธรณ์</p>
                <div className="ms-8">
                    <p>1. กรณีคนพิการไม่ได้รับอนุมัติให้มีบัตรประจำตัวคนพิการ อาจยื่นอุทธรณ์เป็นหนังสือต่อนายทะเบียนแห่งนั้น ภายในสิบห้าวัน นับแต่วันที่ได้รับคำสั่งดังกล่าว </p>
                    <p>2. ให้นายทะเบียนพิจารณาคำอุทธรณ์ให้แล้วเสร็จภายในหกสิบวันนับแต่วันที่ได้รับคำอุทธรณ์แล้ว ให้แจ้งผลการพิจารณาอุทธรณ์พร้อมเหตุผลเป็นหนังสือต่อผู้อุทธรณ์ทราบภายในสิบห้าวันนับแต่วันที่พิจารณาอุทธรณ์เสร็จ
                        คำวินิจฉัยของนายทะเบียนให้เป็นที่สุด</p>
                </div>
                <p>หากคนพิการมีปัญหา หรือมีข้อสงสัยในการดำเนินการขอมีบัตรประจำตัวคนพิการ สามารถติดต่อสอบถามได้ที่</p>
                <div className="ms-8">
                    <p>- กรุงเทพมหานคร ศูนย์บริการคนพิการกรุงเทพมหานคร </p>
                    <p className="font-medium text-shadow-lg ms-2">โทร. 02-3543388 ต่อ 701-705 ในวันและเวลาราชการ</p>

                    <p>- ต่างจังหวัด ศูนย์บริการคนพิการจังหวัด</p>
                </div>
                <p className="font-medium text-shadow-lg">**บัตรประจำตัวคนพิการมีอายุ 8 ปี นับตั้งแต่วันออกบัตร**</p>
            </div>

            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p className="font-medium text-shadow-lg">สิทธิประโยชน์และความคุ้มครองคนพิการ</p>
                <p className="ms-4"> ในเรื่องการศึกษาตามกฎหมายว่าด้วยการศึกษาแห่งชาติ หรือแผนการศึกษาแห่งชาติตามความเหมาะสมในสถานศึกษาเฉพาะ หรือในสถานศึกษาทั่วไป
                    หรือการศึกษาทางเลือก หรือการศึกษานอกระบบ โดยให้หน่วยงานที่รับผิดชอบเกี่ยวกับสิ่งอำนวยความสะดวกสื่อ บริการ และความช่วยเหลืออื่นใดทางการศึกษา
                    สำหรับคนพิการให้การสนับสนุนตามความจำเป็นและเหมาะสมอย่างทั่วถึง </p>
            </div>

            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p className="font-medium text-shadow-lg">การคุ้มครองสิทธิคนพิการทางการศึกษา</p>
                <p className="ms-4"> คนพิการที่มีบัตรประจำตัวคนพิการแล้ว สามารถยื่นคำขอใช้สิทธิเข้าถึงและใช้ประโยชน์ได้จากสิ่งอำนวยความสะดวกอันเป็นสาธารณะ ตลอดจนสวัสดิการและความช่วยเหลืออื่นจากรัฐ ตามมาตรา 20
                    แห่งพระราชบัญญัติส่งเสริมและพัฒนาคุณภาพชีวิตคนพิการ พ.ศ. 2550 หรือตามที่กฎหมายอื่นกำหนด ได้แก่การคุ้มครองสิทธิคนพิการด้านบริการฟื้นฟูสมรรถภาพโดยกระบวนทางการแพทย์
                    ในเรื่องการบริการฟื้นฟูสมรรถภาพโดยกระบวนการทางการแพทย์ และค่าใช้จ่ายในการรักษาพยาบาล ค่าอุปกรณ์เครื่องช่วยความพิการ
                    และสื่อส่งเสริมพัฒนาการเพื่อปรับสภาพทางร่างกาย จิตใจ อารมณ์ สังคม พฤติกรรม สติปัญญา การเรียนรู้ หรือเสริมสร้างสมรรถภาพให้ดีขึ้น </p>
            </div>

            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p className="font-medium text-shadow-lg">การคุ้มครองสิทธิคนพิการด้านการประกอบอาชีพและการมีงานทำ</p>
                <p className="ms-4"> ในเรื่องการฟื้นฟูสมรรถภาพด้านอาชีพ การให้บริการที่มีมาตรฐาน การคุ้มครองแรงงาน มาตรการเพื่อการมีงานทำ ตลอดจนได้รับการส่งเสริมประกอบอาชีพอิสระ
                    และบริการสื่อ สิ่งอำนวยความสะดวกเทคโนโลยี หรือความช่วยเหลืออื่นใด เพื่อการทำงานและประกอบอาชีพของคนพิการ </p>
            </div>

            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p className="font-medium text-shadow-lg">การคุ้มครองสิทธิคนพิการทางสังคมและสวัสดิการสังคม</p>
                <p className="ms-4"> เพื่อให้การคุ้มครองสิทธิคนพิการทางสังคมและสวัสดิการสังคมเป็นไปอย่างทั่วถึง เช่น การให้บริการล่ามภาษามือ การช่วยเหลือทางกฎหมาย การจัดให้มีผู้ช่วยคนพิการ
                    การปรับสภาพแวดล้อมที่อยู่อาศัยให้แก่คนพิการ การช่วยเหลือคนพิการที่ไม่มีผู้ดูแล การส่งเสริมสนับสนุนผู้ดูแลคนพิการ และการจัดสวัสดิการเบี้ย ความพิการ </p>
            </div>

            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p className="font-medium text-shadow-lg">การจัดให้มีสิ่งอำนวยความสะดวก</p>
                <p className="ms-4"> ที่คนพิการเข้าถึงได้ เพื่อคุ้มครองสิทธิคนพิการมีให้สภาพแวดล้อมเป็นอุปสรรคต่อการเข้ามามีส่วนร่วมทางสังคมสำหรับคนพิการ </p>
            </div>

            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p className="font-medium text-shadow-lg">การขจัดการเลือกปฏิบัติโดยไม่เป็นธรรมต่อคนพิการ</p>
                <p className="ms-4"> ได้กำหนดห้ามหน่วยราชการ องค์กรเอกชนหรือบุคคลกระทำการที่มีการเลือกปฏิบัติ โดยไม่เป็นธรรมต่อคนพิการในเรื่องที่เกี่ยวข้องกับการกำหนดนโยบาย กฎ ระเบียบ มาตรการ
                    โครงการ หรือวิธีปฏิบัติของหน่วยงานของรับ องค์กรเอกชน หรือบุคคลใดในลักษณะที่เป็นการเลือกปฏิบัติโดยไม่เป็นธรรมต่อคนพิการ
                    และให้หมายความรวมถึงการกระทำหรืองดเว้นการกระทำใดที่กระทบต่อคนพิการแม้จะไม่มีจุดมุ่งหมายเป็นการเลือกปฏิบัติต่อคนพิการโดยตรง แต่ผลของการกระทำนั้นทำให้คนพิการต้องเสียสิทธิประโยชน์ที่ควรจะได้รับ
                    เพราะเหตุผลแห่งความพิการด้วย ทั้งนี้ กฎหมายกำหนดให้คนพิการที่ได้รับหรือจะได้รับความเสียหายจากการกระทำในลักษณะที่เป็นการเลือกปฏิบัติไม่เป็นธรรมต่อคนพิการสิทธิร้องขอต่อ
                    คณะกรรมการส่งเสริมและพัฒนาคุณภาพชีวิตคนพิการแห่งชาติให้มีคำสั่งเพิกถอนการกระทำหรือห้ามมิให้กระทำการนั้นได้ </p>
            </div>

            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p className="font-medium text-shadow-lg">การลดหย่อนภาษีของผู้ดูแลคนพิการ</p>
                <p className="ms-4"> สิทธิการหักลดหย่อนค่าอุปการะเลี้ยงดูคนพิการซึ่งมีบัตรประจำตัวคนพิการตามกฏหมายของผู้ดูแลคนพิการประจำปีภาษี 2558 นั้น ต้องเป็นผู้ดูแลตามกฏหมายว่าด้วยการส่งเสริมและพัฒนาคุณภาพชีวิตคนพิการโดยมีชื่อ
                    เป็นผู้ดูแลคนพิการในบัตรประจำตัวคนพิการตามกฏหมายว่าด้วยการส่งเสริมและพัฒนาคุณภาพชีวิตคนพิการในปีภาษี 2558 กล่าวคือมีชื่อเป็นผู้ดูแลในบัตรระหว่างวันที่ 1 มกราคม 2558 ถึงวันที่ 31 ธันวาคม 2558
                    รายละเอียดเพิ่มเติมโปรดศึกษาประกาศอธิบดีกรมสรรพากรเกี่ยวกับภาษีเงินได้ (ฉบับที่ 182) เรื่องกำหนดหลักเกณฑ์ วิธีการ และเงื่อนไขรวมทั้งจำนวนคนพิการและคนทุพพลภาพในความอุปการะเลี้ยงดูของผู้มีเงินได้
                    ในการหักลดหย่อนค่าอุปการะเลี้ยงดูคนพิการซึ่งมีบัตรประจำตัวคนพิการตามกฏหมายว่าด้วยการส่งเสริมและพัฒนาคุณภาพชิวิตคนพิการหรือคนทุพพลภาพ </p>
                <div className="flex mt-4">
                    <p className="ms-4"> อ่านรายละเอียดเพิ่มเติม</p>
                    <a href="https://www.rd.go.th/41745.html" className="block hover:text-pink-700 font-semibold text-shadow-lg ms-4"
                        onClick={() => setMobileOpen(false)} >
                        การลดหย่อนภาษีของผู้ดูแลคนพิการ กดที่นี่
                    </a>
                </div>

            </div>

            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p className="font-semibold text-shadow-lg">สถานพยาบาลที่ให้บริการออกเอกสารรับรองความพิการให้แก่คนพิการ</p>
                <p className="ms-4">สถานพยาบาลรัฐบาลสามารถออกเอกสารรับรองความพิการได้ทุกแห่ง </p>
                <p className="ms-4">สถานพยาบาลเอกชนเข้าร่วมออกเอกสารรับรองความพิการให้แก่คนพิการ </p>
                <a href="https://www.dep.go.th/images/uploads/files/dep120966.pdf" className="block hover:text-pink-700 font-semibold text-shadow-lg ms-4"
                    onClick={() => setMobileOpen(false)} >
                    - ประกาศกรมส่งเสริมและพัฒนาคุณภาพชีวิตคนพิการ เรื่อง กำหนดให้สถานพยาบาลเอกชนออกเอกสารรับรองความพิการ
                </a>
                <a href="https://ratchakitcha.soc.go.th/documents/75353.pdf" className="block hover:text-pink-700 font-semibold text-shadow-lg ms-4"
                    onClick={() => setMobileOpen(false)} >
                    - ประกาศกรมส่งเสริมและพัฒนาคุณภาพชีวิตคนพิการ เรื่อง กำหนดให้สถานพยาบาลเอกชนออกเอกสารรับรองความพิการ (ฉบับที่ ๒)
                </a>
                <a href="https://efiling.dep.go.th/download/%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%81%E0%B8%B2%E0%B8%A8_%E0%B9%80%E0%B8%A3%E0%B8%B7%E0%B9%88%E0%B8%AD%E0%B8%87%E0%B8%81%E0%B8%B3%E0%B8%AB%E0%B8%99%E0%B8%94%E0%B9%81%E0%B8%9A%E0%B8%9A%E0%B8%9A%E0%B8%B1%E0%B8%95%E0%B8%A3%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%88%E0%B8%B3%E0%B8%95%E0%B8%B1%E0%B8%A7%E0%B8%84%E0%B8%99%E0%B8%9E%E0%B8%B4%E0%B8%81%E0%B8%B2%E0%B8%A3.pdf" className="block hover:text-pink-700 font-semibold text-shadow-lg ms-4"
                    onClick={() => setMobileOpen(false)} >
                    - ประกาศกรมส่งเสริมและพัฒนาคุณภาพชีวิตคนพิการ เรื่อง กำหนดแบบบัตรประจำตัวคนพิการในรูปแบบอิเล็กทรอนิกส์ ๓ กพ. ๖๙
                </a>
            </div>

            <div className="lg:mt-10 mt-4 md:text-base text-xs">
                <p className="font-semibold text-shadow-lg">ขั้นตอนการบริการออกบัตรประจำตัวคนพิการ</p>
                <div className="flex gap-8">
                <Image
                    src={getSupabaseImage("pic/personIDCard/pic1.png")}
                    alt="ขั้นตอนการบริการออกบัตรประจำตัวคนพิการ"
                    width={600}
                    height={200}
                    className="lg:w-[500px] md:w-[400px] w-[300px] h-auto mt-4"
                    onClick={() => setOpenImage(getSupabaseImage("pic/personIDCard/pic1.png"))}
                />
                <Image
                    src={getSupabaseImage("pic/personIDCard/service-bkk2024.jpg")}
                    alt="ขั้นตอนการบริการออกบัตรประจำตัวคนพิการ"
                    width={600}
                    height={200}
                    className="lg:w-[1000px] md:w-[700px] w-[500px] h-auto mt-4"
                    onClick={() => setOpenImage(getSupabaseImage("pic/personIDCard/service-bkk2024.jpg"))}
                />
            </div></div>

            {openImage && (
                <div
                    className="fixed inset-0 z-50 bg-black/70 backdrop-blur-sm flex items-center justify-center transition-opacity duration-300 "
                    onClick={() => setOpenImage(null)}
                >
                    <div
                        className="relative max-w-xl w-full mx-4 animate-fadein"
                        onClick={(e) => e.stopPropagation()}
                    >
                        <button onClick={() => setOpenImage(null)} className="absolute -top-10 right-0 text-white text-3xl" >
                            ✕
                        </button>
                        <Image
                            src={openImage}
                            alt="ภาพขยาย"
                            width={400}
                            height={500}
                            className="rounded-lg object-contain lg:w-[500px] h-auto"
                        />
                    </div>
                </div>
            )}
        </div>
    );
}